{
  "CER_REF_SIC": {
    "RSIC_CODE": "Standard Industrial Classification (SIC) code or variant.  Valid values contained in the CER_REF_SIC table.", 
    "RSIC_CODE_DESC": "Description of the Standard Industrial Classification (SIC) code or variant."
  }, 
  "CER_REF_CMT_SITE": {
    "RCS_DESC": "The description of the code that classifies the narrative in the corresponding CSITE_TEXT column in the CMT_SITE table.", 
    "RCST_CODE": "Code that classifies the narrative in the corresponding CSITE_TEXT column in the CMT_SITE table."
  }, 
  "CER_REF_ACTION_QUALIFIER": {
    "RAQ_ACTION_QUAL_DESC": "Description of the code which indicates the resulting outcome or action priority level arising from an event.", 
    "RAQ_ACTION_QUAL_CODE": "Code to indicate the resulting outcome or action priority level arising from an event."
  }, 
  "CER_REF_PLANNING_STATUS": {
    "RPS_CODE": "An indicator of the planning status (e.g., primary, alternate) for the purpose of Superfund Comprehensive Accomplishment Plan (SCAP) planning and reporting.", 
    "RPS_DESC": "Indicates if the status of the removal activity is approved, an alternate, or none."
  }, 
  "CER_REF_SITE_INCIDENT_CATEGORY": {
    "RSITINC_DESC": "Decription of the site or incident category code.", 
    "RSITINC_CODE": "Code to identify the overall physical classification of the site or incident.  Valid values contained in the CER_REF_SITE_INCIDENT_CATEGORY table."
  }, 
  "CER_REF_NPL_STATUS": {
    "RNPL_STATUS_CODE": "Code to indicate the site's National Priorities List (NPL) status (proposed for NPL or currently on the final NPL).  Valid values contained in the CER_REF_NPL_STATUS table.", 
    "RNPL_STATUS_DESC": "Description of the National Priorities List (NPL) Status Code which indicates the site's NPL status for statistical analysis and reporting purposes."
  }, 
  "CER_REF_OWNERSHIP_TYPE": {
    "ROT_CODE": "Code to indicate the owner/operator type (e.g., private or municipality).  Valid values contained in the CER_REF_OWNERSHIP_TYPE table.", 
    "ROT_DESC": "Description of the owner/operator type."
  }, 
  "CER_WST_SRC_MEDIA_CONTAMINATED": {
    "WSMC_CLNUP_VLM_HIGH_AMT": "The high amount of the range of volume of media impacted by site-related contamination by an action.", 
    "SITE_ID": "Unique identifier of a site generated by CERCLIS at each Region.", 
    "RVOLUME_UNIT_CODE": "Code to identify a volume unit of measure (e.g., gal).", 
    "WSMC_NMBR": "CERCLIS generated number to distinguish among multiple contaminated media at a site.", 
    "WSMC_CLNUP_VLM_LOW_AMT": "The low amount of the range of volume of media impacted by site-related contamination by an action.", 
    "WSMC_CLNUP_RPRTD_DATE": "Date the waste source or media was reported as cleaned up."
  }, 
  "CER_ACTION": {
    "ACT_ACTL_STRT_DATE": "The approved date an action actually started.", 
    "RPS_CODE": "An indicator of the planning status (e.g., primary, alternate) for the purpose of Superfund Comprehensive Accomplishment Plan (SCAP) planning and reporting.", 
    "OU_ID": "A designation for the operable unit at which actions are occurring. The designation is required to relate actions to operable units for site/project and incident planning and tracking.", 
    "ACT_ACTL_CMPLTN_DATE": "The approved date an action was actually completed.", 
    "ACT_CURR_PLN_STRT_FYQ": "The fiscal year/quarter associated with an approved current plan start date.", 
    "SITE_ID": "Unique identifier of a site generated by CERCLIS at each Region.", 
    "RACT_CRITICAL_FLAG_DESC": "Description of the code which indicates if the action is an emergency, time-critical, or non-time critical.", 
    "RALT_CODE": "Identification of the organization with the primary responsibility for the EPA enforcement or potentially responsible party (PRP) cleanup action.", 
    "ACT_CURR_PLN_STRT_DATE": "The approved date an action is currently planned to start.", 
    "RAT_CODE": "Code indicating a type of Comprehensive Environmental Response, Compensation, and Liability Information System (CERCLIS) action or subaction.", 
    "RACT_CRITICAL_FLAG_CODE": "Identifies the removal action as emergency, time critical, or non-time critical. Valid values contained in the CER_REF_ACTION_CRITICAL_FLAG table.", 
    "RAQ_ACTION_QUAL_CODE": "Code to indicate the resulting outcome or action priority level arising from an event.", 
    "ACT_CURR_PLN_CMPLTN_DATE": "The approved date an action is currently planned to be completed.", 
    "ACT_CURR_PLN_CMPLTN_FYQ": "The fiscal year/quarter associated with an approved current plan completion date.", 
    "RAA_CODE": "Code for identifying phased projects, actions taken over and other anomalies in Superfund Comprehensive Accomplishment Plan (SCAP) accomplishment reporting.", 
    "ACT_CODE_ID": "Unique identifier to distinguish between multiple occurrences of the same action with the same site or operable unit."
  }, 
  "CER_FINANCIAL_TRANSACTION": {
    "FT_DATE": "The approved, official date when a financial transaction is made for an action.", 
    "FT_ID": "A number that uniquely identifies a financial transaction of an action.", 
    "SITE_ID": "Unique identifier of a site generated by CERCLIS at each Region.", 
    "FT_BUDGET_FY": "Code consisting of the beginning budget fiscal year (first 2 digits) and the ending fiscal year (last 2 digits).", 
    "FT_AMT": "The total dollars associated with a financial transaction for an action.", 
    "ACT_CODE_ID": "Unique identifier to distinguish between multiple occurrences of the same action with the same site or operable unit.", 
    "RFTT_CODE": "A core data element indicating the type of planned or actual financial transaction that applies to an action.  Valid values contained in the CER_REF_FINAN_TRANSACTION_TYPE table.", 
    "RAT_CODE": "Code indicating a type of Comprehensive Environmental Response, Compensation, and Liability Information System (CERCLIS) action or subaction."
  }, 
  "CER_SITE": {
    "RNPL_STATUS_CODE": "Code to indicate the site's National Priorities List (NPL) status (proposed for NPL or currently on the final NPL).  Valid values contained in the CER_REF_NPL_STATUS table.", 
    "SITE_ID": "Unique identifier of a site generated by CERCLIS at each Region.", 
    "SITE_SHORT_NAME": "The abbreviated name of the site.", 
    "SITE_PRIMARY_LATITUDE": "The latitude of the site location or incident occurrence expressed in degrees, minutes, seconds, and tenths of seconds.", 
    "SITE_RCRA_ID": "Code that identifies a Resource, Conservation and Recovery Act (RCRA) site in the Resource, Conservation and Recovery Information System (RCRIS).", 
    "SITE_NFRAP_FLAG": "Code to indicate whether there is 'no further remedial action planned' at the site.", 
    "SITE_STRT_ADRS2": "The second line of the street address, route number, or other specific identifier of the physical location of the site of incident.", 
    "SITE_STRT_ADRS1": "The first line of the street address, route number, or other specific identifier of the physical location of the site or incident.", 
    "RFED_FCLTY_CODE": "Code to indicate whether a site is a Federal facility.  Valid values contained in the CER_REF_FEDERAL_FACILITY table.", 
    "SITE_CITY_NAME": "Name of the city, town, village or other municipality in which the site is located or incident occurs.  If the site is not located or if the incident did not occur within such a jurisdiction, the nearest geographical place name.", 
    "RSTATE_CODE": "Unique two-character identifier of the state in which the alias site is located or alias incident occurs.  Valid values contained in the CER_REF_STATE table.", 
    "RSIT_CODE": "The classification of an incident requiring a removal action as either an oil spill or non-oil spill.  Valid values contained in the CER_REF_SITE_INCIDENT_TYPE table.", 
    "RREGION_CODE": "Code identifying the EPA Region.  Valid values contained in the CER_REF_REGION table.", 
    "SITE_SMSA_NMBR": "Code for the standard metropolitan statistical area in which the site is located or the incident occurred.", 
    "SITE_FED_FAC_HAZ_WST_DCKT_FLAG": "A flag that identifies the site as one of the 836 sites contained on the original federal facility hazardous waste compliance docket.", 
    "SITE_NAME": "The official site name for a hazardous waste site or an unanticipated removal (incident).  The official name can be the one used in the federal register at the time of the National Priorities List (NPL) proposal or, for sites not on the NPL, designated by the Region.", 
    "SITE_CNGRSNL_DSTRCT_CODE": "Code that identifies the congressional district in which the site is located or incident occurs.", 
    "SITE_EPA_ID": "A code that uniquely identifies each site or facility.", 
    "SITE_CNTY_CODE": "Code that identifies the county in which the site is located or the incident occurs.", 
    "SITE_USGS_HYDRO_UNIT_NMBR": "A code indicating the hydrologic location of a site, as designated by the United States Geological Survey (USGS) and the U.S. Water Resources Council.", 
    "ROT_CODE": "Code to indicate the owner/operator type (e.g., private or municipality).  Valid values contained in the CER_REF_OWNERSHIP_TYPE table.", 
    "SITE_IFMS_SSID_CODE": "A unique alphanumeric identification code assigned to the site or incident by the Regions for the financial management system.", 
    "RSITINC_CODE": "Code to identify the overall physical classification of the site or incident.  Valid values contained in the CER_REF_SITE_INCIDENT_CATEGORY table.", 
    "SITE_PRIMARY_LONGITUDE": "The longitude of the site location or site incident occurrence expressed in degrees, minutes, seconds, and tenths of seconds.", 
    "SITE_ZIP_CODE": "Code that identifies the U.S. Postal Service delivery area in which the site is located or incident occurs.", 
    "SITE_CNTY_NAME": "Name of the county in which the site is located or incident occurs."
  }, 
  "CER_REF_STATE": {
    "RSTATE_CODE": "Unique two-character identifier of the state in which the alias site is located or alias incident occurs.  Valid values contained in the CER_REF_STATE table.", 
    "RSTATE_NAME": "The name of the state.", 
    "RREGION_CODE": "Code identifying the EPA Region.  Valid values contained in the CER_REF_REGION table."
  }, 
  "CER_CONTACT": {
    "PERSON_PHONE_NMBR1": "The phone number of the on-scene coordinator (OSC) assigned to evaluate the release and possible oversite of removal action activities.", 
    "SITE_ID": "Unique identifier of a site generated by CERCLIS at each Region.", 
    "PERSON_LAST_NAME": "The last name of the on-scene coordinator (OSC) assigned to evaluate the release and possible oversite of removal action activities.", 
    "PERSON_FIRST_NAME": "The first name of the on-scene coordinator (OSC) assigned to evaluate the release and possible oversite of removal action activities."
  }, 
  "CER_REF_SITE_INCIDENT_TYPE": {
    "RSIT_CODE": "The classification of an incident requiring a removal action as either an oil spill or non-oil spill.  Valid values contained in the CER_REF_SITE_INCIDENT_TYPE table.", 
    "RSIT_DESC": "Description of the site incident type code."
  }, 
  "CER_SITE_ALIAS": {
    "SITE_ALIAS_STRT_ADRS": "The street address, route number or other specific identifier of the physical location of the alias for a site.", 
    "SITE_ALIAS_CITY_NAME": "Name of the city, town, village, or other municipality in which the alias site is located or alias incident occurs.  If the alias site is not located or if the alias incident did not occur within such a jurisdiction, the nearest geographical place name.", 
    "SITE_ID": "Unique identifier of a site generated by CERCLIS at each Region.", 
    "SITE_ALIAS_ID": "CERCLIS generated number to uniquely identify each occurrence of a site alias name or address.", 
    "RSTATE_CODE": "Unique two-character identifier of the state in which the alias site is located or alias incident occurs.  Valid values contained in the CER_REF_STATE table.", 
    "SITE_ALIAS_ZIP_CODE": "Code that identifies the U.S. postal service delivery area in which the alias site is located or alias incident occurs.", 
    "SA_NAME": "Alternate name of the site as retained or known by another organization or system, or name given to a non-contiguous portion of the site."
  }, 
  "CER_REF_ACTION_LEAD_TYPE": {
    "RALT_CODE": "Identification of the organization with the primary responsibility for the EPA enforcement or potentially responsible party (PRP) cleanup action.", 
    "R_TAT_FY": "A Regional type of activity, defined in the fiscal year Superfund Comprehensive Accomplishment Plan (SCAP) methodologies or by the Region, for which fiscal year projects are made, annual or quarterly targets are set, and accomplishments reported.", 
    "RALT_DESC": "Action lead type description.", 
    "R_TAT_CODE": "Code of the type of activity, defined in the fiscal year Superfund Comprehensive Accomplishment Plan (SCAP) methodologies or by the Region, for which fiscal year projects are made, annual or quarterly targets are set, and accomplishments reported.", 
    "TA_TYPE_IND": "An indicator of whether the planning/reporting measure is for planning or accomplishments and whether the measure tracks starts or completions."
  }, 
  "CER_REF_ACTION_TYPE": {
    "RAT_C2_TYPE": "Computer-generated Comprehensive Environmental Response, Compensation, and Liability Information System (CERCLIS) 3 field.", 
    "RAT_NSI_INDICATOR": "Displays whether an action is site, non-site, or both.", 
    "RAT_DEFAULT_PRED_ACT_TYPE_CODE": "Code of action relationship between non-like actions.", 
    "RAT_C2_CODE": "Computer-generated Comprehensive Environmental Response, Compensation, and Liability Information System (CERCLIS) 3 field.", 
    "RFBS_CODE": "Code that identifies the source of budgeted dollars for a planned and/or actual action.", 
    "RAT_DEFAULT_ASOC_ACT_TYPE_CODE": "Suggested relationship between non-like actions.", 
    "RAT_CODE": "Code indicating a type of Comprehensive Environmental Response, Compensation, and Liability Information System (CERCLIS) action or subaction.", 
    "RIE_CODE": "Shows if the action allows Integrated Financial Management System (IFMS) entries.", 
    "RAT_DEF": "Definition of action name.", 
    "RAT_SHORT_NAME": "The short description of a Comprehensive Environmental Response, Compensation, and Liability Information System (CERCLIS) action type code.", 
    "RAT_LEVEL": "Indicates whether the action type code is a subaction, action, or user defined subaction.", 
    "RAT_WITHOUT_START_FLAG": "Indicates whether an action requires a start date (subactions).", 
    "RAT_NAME": "The full description of a Comprehensive Environmental Response, Compensation, and Liability Information System (CERCLIS) action type code.", 
    "RAT_HISTORICAL_ONLY_FLAG": "Indicates if an action is historical or not.", 
    "RAT_DEF_OU": "Default operable unit for certain actions."
  }, 
  "CER_FEDERAL_REGISTER": {
    "RFRA_CODE": "The code for the type of Federal Register action.", 
    "SITE_ID": "Unique identifier of a site generated by CERCLIS at each Region.", 
    "FR_DATE": "Date of the Federal Register publication.", 
    "FR_NPL_UPDATE_NMBR": "The number of the rule update in which the site is listed."
  }, 
  "CER_REF_ACTION_CRITICAL_FLAG": {
    "RACT_CRITICAL_FLAG_DESC": "Description of the code which indicates if the action is an emergency, time-critical, or non-time critical.", 
    "RACT_CRITICAL_FLAG_CODE": "Identifies the removal action as emergency, time critical, or non-time critical. Valid values contained in the CER_REF_ACTION_CRITICAL_FLAG table."
  }, 
  "CER_REF_NON_NPL_STATUS": {
    "RNON_NPL_STATUS_CODE": "The code that identifies the pipeline status of a non-NPL site.", 
    "RNON_NPL_STATUS_DESC": "The description of the code that identifies the pipeline status of a non-NPL site."
  }, 
  "CER_REF_FEDERAL_FACILITY": {
    "RFED_FCLTY_DESC": "Description of the code which indicates whether a site is a Federal facility.", 
    "RFED_FCLTY_CODE": "Code to indicate whether a site is a Federal facility.  Valid values contained in the CER_REF_FEDERAL_FACILITY table."
  }, 
  "CER_LOCATION": {
    "SCALE": "The number that represents the proportional distance on the ground for one unit of measure on the map or photo.", 
    "SUB_ID": "Identification for the subentity (i.e., monitoring station, spill, pipe, stacks, or other operable unit).", 
    "VACCURACY": "The measure of the accuracy (in meters) of the vertical measure (i.e., the altitude) of a reference point.", 
    "LOCATION_ADDRESS": "Street number and address of the entity/subentity.", 
    "PRIMARY_NAME": "Name of regulated or monitored entity/subentity.", 
    "CITY_NAME": "City name for the location of the entity/subentity.", 
    "SOURCE_CODE": "The code that represents the party responsible for providing the latitude and longitude coordinates.", 
    "ACCURACY_VALUE": "The measure of the accuracy (in meters) of the latitude and longitude coordinates.", 
    "GEOMETRIC_TYPE_CODE": "The code that represents the geometric entity represented by one point or a sequence of latitude and longitude points.", 
    "COMMENT_TEXT": "The text that provides additional information about the geographic coordinates.", 
    "VDATUM_CODE": "The code that represents the reference datum used to determine thevertical measure (i.e., the altitude).", 
    "COLLECTION_DATE": "The calendar date when the data were collected.", 
    "HDATUM_CODE": "The code that represents the reference datum used in determining latitude and longitude coordinates.", 
    "COUNTY_NAME": "County name for the location of the entity/subentity.", 
    "SUB_TYPE_CODE": "Code which identifies the type of operable unit of the subentity.", 
    "LONGITUDE": "The measure of the angular distance on a meridian east or west of the prime meridian.", 
    "VERTICAL_MEASURE": "The measure of elevation (i.e., the altitude), in meters, above orbelow a reference datum.", 
    "COLLECT_MTH_CODE": "The code that represents the method used to determine the latitude and longitude coordinates for a point on the earth.", 
    "SITE_EPA_ID": "A code that uniquely identifies each site or facility.", 
    "POSTAL_CODE": "U.S. Postal Zone Improvement Plan (ZIP) Code of physical or nearest location (ZIP, or ZIP+4) of the entity/subentity.", 
    "VMETHOD_CODE": "The code that represents the method used to collect the vertical measure (i.e., the altitude) of a reference point.", 
    "REF_POINT_CODE": "The code that represents the place for which geographic coordinates were established.", 
    "LATITUDE": "The measure of the angular distance on a meridian north or south of the equator.", 
    "STATE_CODE": "U.S. Post Office state abbreviation of the entity/subentity."
  }, 
  "CER_REF_FDRL_RGSTR_ACTN": {
    "RFRA_CODE": "The code for the type of Federal Register action.", 
    "RFRA_DESC": "The description of the type of Federal Register action."
  }, 
  "CER_REF_FINAN_TRANSACTION_TYPE": {
    "RFTT_SHORT_NAME": "The short description of the transaction type code which indicates the type of planned or actual financial transaction that applies to an action.", 
    "RFTT_PLAN_ACT": "http://oaspub.epa.gov/enviro/EF_METADATA_HTML.column_page?p_column_name=RFTT_PLAN_ACT&p_topic=CERCLIS", 
    "RFTT_LONG_NAME": "The full description of the transaction type code which indicates the type of planned or actual financial transaction that applies to an action.", 
    "RFTT_CODE": "A core data element indicating the type of planned or actual financial transaction that applies to an action.  Valid values contained in the CER_REF_FINAN_TRANSACTION_TYPE table.", 
    "RFTT_ORDER": "http://oaspub.epa.gov/enviro/EF_METADATA_HTML.column_page?p_column_name=RFTT_ORDER&p_topic=CERCLIS"
  }, 
  "CER_REF_ACTION_ANOMALY": {
    "RAA_CODE": "Code for identifying phased projects, actions taken over and other anomalies in Superfund Comprehensive Accomplishment Plan (SCAP) accomplishment reporting.", 
    "RAA_DESC": "Description of the action anomaly code."
  }, 
  "CER_REF_REGION": {
    "RR_IP_NAME": "http://oaspub.epa.gov/enviro/EF_METADATA_HTML.column_page?p_column_name=RR_IP_NAME&p_topic=CERCLIS", 
    "RR_IP_NMBR": "http://oaspub.epa.gov/enviro/EF_METADATA_HTML.column_page?p_column_name=RR_IP_NMBR&p_topic=CERCLIS", 
    "RREGION_CITY_NAME": "Region city name.", 
    "RREGION_CNTY_CODE": "Region county code.", 
    "RREGION_DESC": "Description of the EPA Region.", 
    "RREGION_STRT_ADRS2": "Region street address line 2.", 
    "RREGION_STRT_ADRS1": "Region street address line 1.", 
    "RSTATE_CODE": "Unique two-character identifier of the state in which the alias site is located or alias incident occurs.  Valid values contained in the CER_REF_STATE table.", 
    "RREGION_CODE": "Code identifying the EPA Region.  Valid values contained in the CER_REF_REGION table.", 
    "RREGION_CNTY_NAME": "Region county name.", 
    "RREGION_ZIP_CODE": "Region ZIP Code."
  }, 
  "CER_CMT_SITE": {
    "CSITE_SEQ_NMBR": "CERCLIS generated sequence number to identify site comments.", 
    "CSITE_TEXT": "A textual description of the site or incident characteristics that are not captured in other data elements.", 
    "SITE_ID": "Unique identifier of a site generated by CERCLIS at each Region.", 
    "RCST_CODE": "Code that classifies the narrative in the corresponding CSITE_TEXT column in the CMT_SITE table."
  }, 
  "CER_CMT_SITE_ALIAS": {
    "CSA_SEQ_NMBR": "CERCLIS generated sequence number to identify site alias comments.", 
    "SITE_ID": "Unique identifier of a site generated by CERCLIS at each Region.", 
    "SITE_ALIAS_ID": "CERCLIS generated number to uniquely identify each occurrence of a site alias name or address.", 
    "CSA_TEXT": "A textual description of characteristics of the site alias that are not captured in other data elements."
  }, 
  "CER_WSMC_CROSS_LINK": {
    "WSMC_NMBR": "CERCLIS generated number to distinguish among multiple contaminated media at a site.", 
    "SITE_ID": "Unique identifier of a site generated by CERCLIS at each Region.", 
    "WCL_C2501": "Used for CERCLIS2 to CERCLIS3 conversion."
  }, 
  "CER_OPERABLE_UNIT": {
    "SITE_ID": "Unique identifier of a site generated by CERCLIS at each Region.", 
    "OU_ID": "A designation for the operable unit at which actions are occurring. The designation is required to relate actions to operable units for site/project and incident planning and tracking.", 
    "OU_DESC_TEXT": "Description of general characteristics and response events occurring at the operable unit.", 
    "OU_NAME": "Name associated with a portion of a site that has defined boundaries within that site."
  }
}
