{
  "EFFRS_AFSACT1": {
    "POLLUTANT_CODE": "A five-digit code", 
    "STATE_COUNTY_COMPLIANCE_SOURCE": "A ten-character field identifying a facility through the concatenation of the State-County-and-Source ID number.", 
    "REGIONAL_DATA_ELEMENT": "A two-character code defined by the user.", 
    "ACTION_NUMBER": "A 5-digit numeric action identifier.", 
    "CREATION_DATE": "The date in which an action record is created. Automatically generated when a new plant action is created via online or batch update.", 
    "RESULTS_CODE": "A two-character code indicating whether an action has been achieved or if another action should be referred to.", 
    "AIR_PROGRAM_CODES": "A one-character code used to identify: 1) the regulatory air program a plant is subject to. 2) The regulatory air program authorizing and associated with an action taken by a local, state, tribal or Federal regulatory agency.", 
    "NATIONAL_ACTION_TYPE": "A two-character code identifying a compliance activity.  Two categories of action types exist:  National Action Types which are used to retrieve similar compliance activities identified by EPA and Regions using Region-specific action type Codes and Regional Action Type codes which are the Region-specific codes used to identify a compliance activity.", 
    "ACTION_DESC": "The action description generated from defined action types.", 
    "ACTION_TYPE": "A two-character code identifying a compliance activity.  Two categories of action types exist:  National Action Types which are used to retrieve similar compliance activities identified by EPA and Regions using Region-specific action type Codes and Regional Action Type codes which are the Region-specific codes used to identify a compliance activity.", 
    "REGIONAL_DATA_ELEMENT_16": "A sixteen-character code defined by the user on the action record.", 
    "HPV_ADDRESSING_ACTION_DESC": "The description of an action used to address a High Priority Violator (HPV) pathway.", 
    "DATE_ACHIEVED": "The date on which an action is completed.", 
    "NATIONAL_ACTION_DESC": "The action description generated from defined action types.", 
    "RESULTS_CODE_DESC": "Description of the Results Code.", 
    "PENALTY_AMT": "An assessed penalty associated with an action.", 
    "KEY_ACTION_NUMBERS": "A key action number assigned to an action to indicate which violation pathway the action is linked.  An action can be linked into a maximum of five pathways."
  }, 
  "EFFRS_AFSACT2": {
    "LEAD_AGENCY_DESC": "The description of the agency taking the lead role in tracking a High Priority Violator (HPV) pathway.", 
    "DATE_CREATED": "The date in which an action record is created. Automatically generated when a new plant action is created via online or batch update.", 
    "DATE_ACHIEVED": "The date on which an action is completed.", 
    "STATE_COUNTY_COMPLIANCE_SOURCE": "A ten-character field identifying a facility through the concatenation of the State-County-and-Source ID number.", 
    "HPV_DAY_ZERO_ACTION_TYPE": "A two-character code identifying the Day Zero (or start date) of a High Priority Violator (HPV) pathway.  Two categories of action types exist:  National Action Types which are used to retrieve similar compliance activities identified by EPA and Regions using Region-specific action type Codes and Regional Action Type codes which are the Region-specific codes used to identify a compliance activity.", 
    "HPV_DISCOVERY_ACTION_DESC": "The description of an action identifying the Discovery Date of a High Priority Violator (HPV) pathway.  Two categories of action types exist:  National Action Types which are used to retrieve similar compliance activities identified by EPA and Regions using Region-specific action type Codes and Regional Action Type codes which are the Region-specific codes used to identify a compliance activity.", 
    "AIR_PROGRAM_CODES": "A one-character code used to identify: 1) the regulatory air program a plant is subject to. 2) The regulatory air program authorizing and associated with an action taken by a local, state, tribal or Federal regulatory agency.", 
    "HPV_RESOLUTION_ACTION_TYPE": "A two-character code identifying the resolution of a High Priority Violator (HPV) pathway.  Two categories of action types exist:  National Action Types which are used to retrieve similar compliance activities identified by EPA and Regions using Region-specific action type Codes and Regional Action Type codes which are the Region-specific codes used to identify a compliance activity.", 
    "NATIONAL_ACTION_TYPE": "A two-character code identifying a compliance activity.  Two categories of action types exist:  National Action Types which are used to retrieve similar compliance activities identified by EPA and Regions using Region-specific action type Codes and Regional Action Type codes which are the Region-specific codes used to identify a compliance activity.", 
    "ACTION_TYPE": "A two-character code identifying a compliance activity.  Two categories of action types exist:  National Action Types which are used to retrieve similar compliance activities identified by EPA and Regions using Region-specific action type Codes and Regional Action Type codes which are the Region-specific codes used to identify a compliance activity.", 
    "VIOLATION_IDENTIFIER": "A code that indicates which agency identified the violation that requires tracking to resolution using the action linking mechanism in a High Priority Violator (HPV) pathway.", 
    "VIOLATION_POLLUTANTS": "A code identifying a pollutant for the air program which has been identified as being in violation.  This code enables a historical record of which pollutants were associated with the High Priority Violator (HPV) pathway.  The first pollutant listed is deemed to be the primary pollutant of record for a violation.  The three other violating pollutants can be changed or overwritten by the user.  The pollutant code on a new key action for a violation will automatically be inserted as the first violating pollutant; changes to the key action pollutant will automatically change the existing violating pollutants.", 
    "HPV_DISCOVERY_ACTION_TYPE": "A two-character code identifying the Discovery Date of a High Priority Violator (HPV) pathway.  Two categories of action types exist:  National Action Types which are used to retrieve similar compliance activities identified by EPA and Regions using Region-specific action type Codes and Regional Action Type codes which are the Region-specific codes used to identify a compliance activity.", 
    "HPV_RESOLUTION_ACTION_DESC": "The description of an action identifying the resolution of a High Priority Violator (HPV) pathway.  Two categories of action types exist:  National Action Types which are used to retrieve similar compliance activities identified by EPA and Regions using Region-specific action type Codes and Regional Action Type codes which are the Region-specific codes used to identify a compliance activity.", 
    "HPV_ADDRESSING_ACTION_TYPE": "A two-character code identifying the addressing action of a High Priority Violator (HPV) pathway.  Two categories of action types exist:  National Action Types which are used to retrieve similar compliance activities identified by EPA and Regions using Region-specific action type Codes and Regional Action Type codes which are the Region-specific codes used to identify a compliance activity.", 
    "HPV_DAY_ZERO_ACTION_DATE": "The date on which an action is completed.", 
    "HPV_ADDRESSING_ACTION_DESC": "The description of an action used to address a High Priority Violator (HPV) pathway.", 
    "HPV_DAY_ZERO_ACTION_DESC": "The description of an action identifying the Day Zero (or start date) of a High Priority Violator (HPV) pathway.  Two categories of action types exist:  National Action Types which are used to retrieve similar compliance activities identified by EPA and Regions using Region-specific action type Codes and Regional Action Type codes which are the Region-specific codes used to identify a compliance activity.", 
    "HPV_RESOLUTION_DATE": "The date on which an action is completed.", 
    "VIOLATION_TYPE_CODES": "Codes that identify the types of violations cited for a High Priority Violator (HPV) violation.  Violations type codes may be input for violation using the action linking mechanism.  Up to seven occurrence of the three-character violation type code may be entered.", 
    "HPV_ADDRESSING_ACTION_PENALTY": "The assessed penalty associated with an addressing action on a High Priority Violator (HPV) pathway.", 
    "ACTION_NUMBER": "A five-digit numeric field used to uniquely identify an action record.", 
    "HPV_DISCOVERY_DATE": "HPV Discovery Date", 
    "HPV_ADDRESSING_ACTION_DATE": "The date on which an action is completed.", 
    "LEAD_AGENCY": "A one-character code that identifies the agency taking the lead role in tracking a High Priority Violator (HPV) pathway."
  }, 
  "EFFRS_AFSAP": {
    "EPA_CLASS_CODE_DESC": "The description of the AFS-generated reflecting EPA's categorization of plants according to the Alabama Power Decision's definition of a major source, or if the emissions of a pollutant have exceeded the major threshold for that pollutant.  Values can be entered by the delegated agency or EPA.  AFS will generated a default value based on the highest level of emissions reported by either the delegated agency or EPA.", 
    "AIR_PROGRAM_DESC": "A description of the air program code.", 
    "STATE_COUNTY_COMPLIANCE_SOURCE": "A ten-character field identifying a facility through the concatenation of the State-County-and-Source ID number.", 
    "ES_COMPLIANCE_STATUS_DESC": "The description of a code which reflects the compliance of a plant which regards to pollutants regulated by an air program or by the procedural requirements of a permit.  Compliance falls within four categories:  In, Out, On Schedule, and Unknown.  Values entered at the Plant Air Program Pollutant level are compared by AFS and the most serious generated and displayed at the Plant Air Program and Plant General level.", 
    "AIR_PROGRAM_STATUS_DESC": "A description of the air program operating status.", 
    "STATE_CLASS_CODE_DESC": "The description of the AFS-generated code reflecting the delegated agency's (State/Local/Tribal) categorization of plants according to the Alabama Power Decision's definition of a major source, or if the emissions of a pollutant have exceeded the major threshold for that pollutant.  Values can be entered by the delegated agency or EPA.  AFS will generated a default value based on the highest level of emissions reported by either the delegated agency or EPA.", 
    "AIR_PROGRAM_STATUS": "A code representing the operational condition of a plant.  The operating status for a plant is generated from the most significant operative value assigned to subordinate air programs.", 
    "STATE_COMPLIANCE_STATUS": "A code which reflects the delegated agency's (State/Local/Tribal) determination of the compliance of a plant which regards to pollutants regulated by an air program or by the procedural requirements of a permit.   Compliance falls within four categories:  In, Out, On Schedule, and Unknown.  Values entered at the Plant Air Program Pollutant level are compared by AFS and the most serious generated and displayed at the Plant Air Program and Plant General level.", 
    "STATE_CLASS_CODE": "An AFS-generated code reflecting the delegated agency's (State/Local/Tribal) categorization of plants according to the Alabama Power Decision's definition of a major source, or if the emissions of a pollutant have exceeded the major threshold for that pollutant.  Values can be entered by the delegated agency or EPA.  AFS will generated a default value based on the highest level of emissions reported by either the delegated agency or EPA.", 
    "EPA_COMPLIANCE_STATUS_DESC": "The description of a code which reflects the EPA's determination of the compliance of a plant which regards to pollutants regulated by an air program or by the procedural requirements of a permit.  This value is normally populated only when the EPA assessment differs from the state or the air program has not been delegated to the appropriate agency for oversight.  Compliance falls within four categories:  In, Out, On Schedule, and Unknown.  Values entered at the Plant Air Program Pollutant level are compared by AFS and the most serious generated and displayed at the Plant Air Program and Plant General level.", 
    "STATE_COMPLIANCE_STATUS_DESC": "The description of a code which reflects the delegated agency's (State/Local/Tribal) determination of the compliance of a plant which regards to pollutants regulated by an air program or by the procedural requirements of a permit.  Compliance falls within four categories:  In, Out, On Schedule, and Unknown.  Values entered at the Plant Air Program Pollutant level are compared by AFS and the most serious generated and displayed at the Plant Air Program and Plant General level.", 
    "EPA_COMPLIANCE_STATUS": "A code which reflects the EPA's determination of the compliance of a plant which regards to pollutants regulated by an air program or by the procedural requirements of a permit.  This value is normally populated only when the EPA assessment differs from the state or the air program has not been delegated to the appropriate agency for oversight.  Compliance falls within four categories:  In, Out, On Schedule, and Unknown.  Values entered at the Plant Air Program Pollutant level are compared by AFS and the most serious generated and displayed at the Plant Air Program and Plant General level.", 
    "ES_CLASS_CODE_DESC": "The description of the AFS-generated default code categorizing plants according to the Alabama Power Decision's definition of a major source, or if the emissions of a pollutant have exceeded the major threshold for that pollutant.  Values can be entered by the delegated agency or EPA.  AFS will generated a default value based on the highest level of emissions reported by either the delegated agency or EPA.", 
    "AIR_PROGRAM_SUBPART_DESC": "The description of the air program subpart.", 
    "AIR_PROGRAMS": "All air programs applicable at a plant.", 
    "AIR_PROGRAM_SUBPART": "Codes indicating the subpart for air programs from Part 40 CFR Parts 60, 61, and 63.", 
    "ES_COMPLIANCE_STATUS": "An AFS-generated code which reflects the compliance of a plant which regards to pollutants regulated by an air program or by the procedural requirements of a permit.   Compliance falls within four categories:  In, Out, On Schedule, and Unknown.  Values entered at the Plant Air Program Pollutant level are compared by AFS and the most serious generated and displayed at the Plant Air Program and Plant General level.", 
    "EPA_CLASS_CODE": "An AFS-generated code reflecting EPA's categorization of plants according to the Alabama Power Decision's definition of a major source, or if the emissions of a pollutant have exceeded the major threshold for that pollutant.  Values can be entered by the delegated agency or EPA.  AFS will generated a default value based on the highest level of emissions reported by either the delegated agency or EPA.", 
    "ES_CLASS_CODE": "An AFS-generated default code categorizing plants according to the Alabama Power Decision's definition of a major source, or if the emissions of a pollutant have exceeded the major threshold for that pollutant.  Values can be entered by the delegated agency or EPA.  AFS will generated a default value based on the highest level of emissions reported by either the delegated agency or EPA.", 
    "AIR_PROGRAM_CODE": "A one-character code used to identify: 1) the regulatory air program a plant is subject to. 2) The regulatory air program authorizing and associated with an action taken by a local, state, tribal or Federal regulatory agency."
  }, 
  "EFFRS_AFSAPP": {
    "ES_ATTAIN_IND": "An AFS-generated code of an air quality standard for a geographic area.  The default value is generated from EPA and delegated agency values, using the EPA value if present.  If the EPA value is not present, the state value (delegated agency) is used.", 
    "ES_PLLT_CLASS_DESC": "The description of the code entered by EPA categorizing plants according to the Alabama Power Decision's definition of a major source, or if the emissions of a pollutant have exceeded the major threshold for that pollutant.  Values can be entered by the delegated agency or EPA.  AFS will generated a default value based on the highest level of emissions reported by either the delegated agency or EPA.", 
    "STATE_PLLT_COMPLIANCE_STATUS": "", 
    "ES_PLLT_COMPLIANCE_DESC": "Twenty-five character description of an EPA pollutant compliance code.", 
    "STATE_ATTAIN_IND_DESC": "The description of a delegated agency-entered (State/Local/Tribal) code of an air quality standard for a geographic area.  The default value is generated from EPA and delegated agency values, using the EPA value if present.  If the EPA value is not present, the state value (delegated agency) is used.", 
    "STATE_PLLT_CLASS_CODE": "A code entered by the delegated agency (State/Local/Tribal) categorizing plants according to the Alabama Power Decision's definition of a major source, or if the emissions of a pollutant have exceeded the major threshold for that pollutant.  Values can be entered by the delegated agency or EPA.  AFS will generated a default value based on the highest level of emissions reported by either the delegated agency or EPA.", 
    "POLLUTANT_CODE_DESC": "The description of a pollutant emitted by a plant in AFS.", 
    "EPA_PLLT_CLASS_CODE": "A code entered by EPA categorizing plants according to the Alabama Power Decision's definition of a major source, or if the emissions of a pollutant have exceeded the major threshold for that pollutant.  Values can be entered by the delegated agency or EPA.  AFS will generated a default value based on the highest level of emissions reported by either the delegated agency or EPA.", 
    "AIR_PROGRAM_CODE": "A one-character code used to identify: 1) the regulatory air program a plant is subject to. 2) The regulatory air program authorizing and associated with an action taken by a local, state, tribal or Federal regulatory agency.", 
    "STATE_COUNTY_COMPLIANCE_SOURCE": "A ten-character field identifying a facility through the concatenation of the State-County-and-Source ID number.", 
    "STATE_ATTAIN_IND": "The code entered by a delegated agency (State/Local/Tribal) of an air quality standard for a geographic area.  The default value is generated from EPA and delegated agency values, using the EPA value if present.  If the EPA value is not present, the state value (delegated agency) is used.", 
    "STATE_PLLT_CLASS_DESC": "The description of the code entered by the delegated agency (State/Local/Tribal) categorizing plants according to the Alabama Power Decision's definition of a major source, or if the emissions of a pollutant have exceeded the major threshold for that pollutant.  Values can be entered by the delegated agency or EPA.  AFS will generated a default value based on the highest level of emissions reported by either the delegated agency or EPA.", 
    "ES_PLLT_COMPLIANCE_STATUS": "A one-character code which reflects the EPA's determination of the compliance of a facility (or point within a facility) with regards to pollutants regulated by an air program or by the procedural requirements of a permit. This value is normally populated only when the EPA assessment differs from the state. Compliance falls within four categories: in, out, on schedule, and unknown. Values entered at the plant air program pollutant level are compared by AFS, and the most serious generated and displayed at the plant air program level. The most serious air program values are in turn displayed at the plant general level. Point level data is not evaluated for the purpose of determining worst case scenarios.", 
    "EPA_ATTAIN_IND_DESC": "The description of an EPA-entered code of an air quality standard for a geographic area.  The default value is generated from EPA and delegated agency values, using the EPA value if present.  If the EPA value is not present, the state value (delegated agency) is used.", 
    "DATE_RECORD_UPDATED": "A generated field containing the most current date on which changes were made to data related to a record.", 
    "CHEMICAL_ABSTRACT_SERVICE_DESC": "The description of the chemical abstract service number associated with a pollutant", 
    "EPA_ATTAIN_IND": "The code entered by EPA of an air quality standard for a geographic area.  The default value is generated from EPA and delegated agency values, using the EPA value if present.  If the EPA value is not present, the state value (delegated agency) is used.", 
    "EPA_PLLT_CLASS_DESC": "The description of the code entered by EPA categorizing plants according to the Alabama Power Decision's definition of a major source, or if the emissions of a pollutant have exceeded the major threshold for that pollutant.  Values can be entered by the delegated agency or EPA.  AFS will generated a default value based on the highest level of emissions reported by either the delegated agency or EPA.", 
    "ES_ATTAIN_IND_DESC": "The description of an AFS-generated code of an air quality standard for a geographic area.  The default value is generated from EPA and delegated agency values, using the EPA value if present.  If the EPA value is not present, the state value (delegated agency) is used.", 
    "CHEMICAL_ABSTRACT_SERVICE_NUM": "The chemical abstract service number associated with a pollutant", 
    "ES_PLLT_CLASS_CODE": "A code entered by EPA categorizing plants according to the Alabama Power Decision's definition of a major source, or if the emissions of a pollutant have exceeded the major threshold for that pollutant.  Values can be entered by the delegated agency or EPA.  AFS will generated a default value based on the highest level of emissions reported by either the delegated agency or EPA.", 
    "POLLUTANT_CODE": "A code identifying a pollutant emitted by a plant in AFS.", 
    "EPA_PLLT_COMPLIANCE_STATUS": "A code which reflects the EPA's determination of the compliance of a plant which regards to pollutants regulated by an air program or by the procedural requirements of a permit.  This value is normally populated only when the EPA assessment differs from the state or the air program has not been delegated to the appropriate agency for oversight.  Compliance falls within four categories:  In, Out, On Schedule, and Unknown.  Values entered at the Plant Air Program Pollutant level are compared by AFS and the most serious generated and displayed at the Plant Air Program and Plant General level.", 
    "AIR_PROGRAMS": "All air programs applicable at a plant."
  }, 
  "EFFRS_AFSCMS": {
    "REGION_CODE": "A two-character code identifying the EPA region in which the plant is located.", 
    "FY2009_CMS_IND": "An AFS-generated value of the FY2009 Compliance Monitoring Strategy (CMS) source category.", 
    "FY2012_CMS_IND_DESC": "A description of the AFS-generated value of the FY2012 Compliance Strategy (CMS) source category.", 
    "CMS_START_DATE": "An AFS-generated date when a Compliance Monitoring Strategy (CMS) source category is added to a plant CMS record.", 
    "STATE_COUNTY_COMPLIANCE_SOURCE": "A ten-character field identifying a facility through the concatenation of the State-County-and-Source ID number.", 
    "STATE_NAME": "A twenty-character name for state code or state name.", 
    "EPA_PLANT_ID": "An EPA-wide facility ID number which identifies a plant.  AFS populates these numbers on a cyclic basis from the Federal Registry System (FRS).", 
    "PLANT_ID": "An AFS internal identification number for a plant.", 
    "FY2010_CMS_IND": "An AFS-generated value of the FY2010 Compliance Monitoring Strategy (CMS) source category.", 
    "DUN_BRADSTREET_NUMBER": "A number assigned by Dun & Bradstreet to the plant.", 
    "FY2011_CMS_IND_DESC": "A description of the AFS-generated value of the FY2011 Compliance Strategy (CMS) source category.", 
    "FY2013_CMS_IND": "An AFS-generated value of the FY2013 Compliance Monitoring Strategy (CMS) source category.", 
    "FY2008_CMS_IND_DESC": "A description of the AFS-generated value of the FY2008 Compliance Strategy (CMS) source category.", 
    "FY2013_CMS_IND_DESC": "A description of the AFS-generated value of the FY2013 Compliance Strategy (CMS) source category.", 
    "COUNTY_NAME": "The name of a county identified by the FIPS county code.", 
    "CMS_SOURCE_CATEGORY": "A one-character field used to indicate the source category to which a plant subject to the Compliance Monitoring Strategy (CMS) belongs.", 
    "FY2012_CMS_IND": "An AFS-generated value of the FY2012 Compliance Monitoring Strategy (CMS) source category.", 
    "FY2011_CMS_IND": "An AFS-generated value of the FY2011 Compliance Monitoring Strategy (CMS) source category.", 
    "FY2014_CMS_IND": "An AFS-generated value of the FY2014 Compliance Monitoring Strategy (CMS) source category.", 
    "FY2015_CMS_IND": "An AFS-generated value of the FY2015 Compliance Monitoring Strategy (CMS) source category.", 
    "FY2009_CMS_IND_DESC": "A description of the AFS-generated value of the FY2009 Compliance Strategy (CMS) source category.", 
    "FY2008_CMS_IND": "An AFS-generated value of the FY2008 Compliance Monitoring Strategy (CMS) source category.", 
    "FY2010_CMS_IND_DESC": "A description of the AFS-generated value of the FY2010 Compliance Strategy (CMS) source category.", 
    "FY2015_CMS_IND_DESC": "A description of the AFS-generated value of the FY2015 Compliance Strategy (CMS) source category.", 
    "STATE_ABBREV": "A two character postal abbreviation code identifying a state.", 
    "FY2014_CMS_IND_DESC": "A description of the AFS-generated value of the FY2014 Compliance Strategy (CMS) source category."
  }, 
  "EFFRS_AFSSUBP": {
    "REGION_CODE": "A two-character code identifying the EPA region in which the plant is located.", 
    "STATE_COUNTY_COMPLIANCE_SOURCE": "A ten-character field identifying a facility through the concatenation of the State-County-and-Source ID number.", 
    "STATE_NAME": "A twenty-character name for state code or state name.", 
    "EPA_PLANT_ID": "An EPA-wide facility ID number which identifies a plant.  AFS populates these numbers on a cyclic basis from the Federal Registry System (FRS).", 
    "PLANT_ID": "An AFS internal identification number for a plant.", 
    "COUNTY_NAME": "The name of a county identified by the FIPS county code.", 
    "CDS_PLANT_ID": "A plant identifier required to assign compliance information to plants in AFS.  The five-characters of this code reflect a unique number within a FIPS county.", 
    "STATE_ABBREV": "A two character postal abbreviation code identifying a state.", 
    "SUBPART_HORIZONTAL": "A horizontal display of all air program subpart values.", 
    "DUN_BRADSTREET_NUMBER": "A number assigned by Dun & Bradstreet to the plant.", 
    "COUNTY_CODE": "County Code", 
    "STATE_CODE": "State Code", 
    "AIR_PROGRAM_CODE": "A one-character code used to identify: 1) the regulatory air program a plant is subject to. 2) The regulatory air program authorizing and associated with an action taken by a local, state, tribal or Federal regulatory agency."
  }, 
  "EFFRS_AFSPLT1": {
    "REGION_CODE": "A two-character code identifying the EPA region in which the plant is located.", 
    "LOCAL_CONTROL_REGION_DESC": "The description of the code identifying the Local Control Region with jurisdiction over a plant", 
    "NAICS_CODE": "NAICS Code", 
    "CDS_PLANT_ID": "A five-character plan identifier required to assign compliance information to plants in AFS.", 
    "PLANT_CITY": "Plant City", 
    "COUNTY_CODE": "County Code", 
    "SECONDARY_SIC_CODE": "Secondary SIC Code", 
    "OPERATING_STATUS": "An AFS-generated code representing the operation condition of a plant.  The operating status for a plant is generated from the most significant operative value assigned to subordinate air programs.", 
    "STATE_COUNTY_COMPLIANCE_SOURCE": "A ten-character field identifying a facility through the concatenation of the State-County-and-Source ID number.", 
    "STATE_NAME": "A twenty-character name for state code or state name.", 
    "EPA_PLANT_ID": "An EPA-wide facility ID number which identifies a plant.  AFS populates these numbers on a cyclic basis from the Federal Registry System (FRS).", 
    "PLANT_ID": "An AFS internal identification number for a plant.", 
    "DATE_PLANT_INFO_LAST_UPDATED": "Generated field containing the most current date on which changes were made to information concerning a plant.", 
    "GOVT_FACILITY_CODE_DESC": "The description of the Government Facility Code describing what entity owns or operates a plant.", 
    "HPV_FLAG": "An AFS-generated value indicating High Priority Violators (HPVs) and the status of the violation.", 
    "PLANT_NAME": "Plant Name", 
    "DUN_BRADSTREET_NUMBER": "A number assigned by Dun & Bradstreet to the plant.", 
    "NAT_INIT_AIR_TOXICS_DESC": "The description of the code identifying plants involved in the FY2009 National Air Toxics Initiative.", 
    "PRIMARY_SIC_CODE": "Primary SIC Code", 
    "NAICS_CODE_DESCRIPTION": "NAICS Code Description", 
    "COUNTY_NAME": "The name of a county identified by the FIPS county code.", 
    "NAT_INIT_AIR_TOXICS": "A code identifying plants involved in the FY2009 National Air Toxics Initiative.", 
    "NAICS_EQUIVALENT_SIC": "NAICS Equivalent SIC", 
    "SIC_EQUIVALENT_NAICS": "SIC Equivalent NAICS", 
    "OPERATING_STATUS_DESCRIPTION": "A description of the default operating status.", 
    "ZIP_CODE": "Zip Code", 
    "LOCAL_CONTROL_REGION": "A code identifying the Local Control Region with jurisdiction over a plant", 
    "AFS_PLANT_ID": "A fifteen-character plan identifier required to enter permit information for plants.  It must be unique within county and requires the FIPS state and county codes to uniquely identify a plant in AFS.  This is an optional use field.", 
    "STATE_REGISTRATION_NUMBER": "A state-assigned identifier used by the agency to identify a plant.", 
    "PLANT_STREET_ADDRESS": "Plant Street Address", 
    "STATE_ABBREV": "A two character postal abbreviation code identifying a state.", 
    "PRIMARY_SIC_DESCRIPTION": "Primary SIC Description", 
    "TERTIARY_SIC_CODE": "The Standard Industrial Code.", 
    "STATE_CODE": "State Code"
  }, 
  "EFFRS_AFSPLT2": {
    "MAILING_PLANT_NAME": "Mailing Plant Name", 
    "ES_LATEST_FCE_ACTION_TYPE": "The default value of the action type code reflecting the latest evaluation of the plant by either EPA or the delegated agency.", 
    "CONTACT_PERSION_COMPLIANCE": "The name of a person to contact concerning compliance matters at a plant.", 
    "STATE_CLASS_CODE": "An AFS-generated code reflecting the delegated agency's (State/Local/Tribal) categorization of plants according to the Alabama Power Decision's definition of a major source, or if the emissions of a pollutant have exceeded the major threshold for that pollutant.  Values can be entered by the delegated agency or EPA.  AFS will generated a default value based on the highest level of emissions reported by either the delegated agency or EPA.", 
    "ES_CLASS_CODE_DESC": "The description of the AFS-generated default code categorizing plants according to the Alabama Power Decision's definition of a major source, or if the emissions of a pollutant have exceeded the major threshold for that pollutant.  Values can be entered by the delegated agency or EPA.  AFS will generated a default value based on the highest level of emissions reported by either the delegated agency or EPA.", 
    "STATE_COMPLIANCE_STATUS_DESC": "The description of a code which reflects the delegated agency's (State/Local/Tribal) determination of the compliance of a plant which regards to pollutants regulated by an air program or by the procedural requirements of a permit.  Compliance falls within four categories:  In, Out, On Schedule, and Unknown.  Values entered at the Plant Air Program Pollutant level are compared by AFS and the most serious generated and displayed at the Plant Air Program and Plant General level.", 
    "ES_LATEST_FCE_DATE_ACHIEVED": "The default date of the latest evaluation of the plant by either EPA or the delegated agency.", 
    "STATE_LATEST_FCE_ACTION_TYPE": "The action type code reflecting the latest evaluation of the plant by the delegated agency (State/Local/Tribal).", 
    "STATE_COUNTY_COMPLIANCE_SOURCE": "A ten-character field identifying a facility through the concatenation of the State-County-and-Source ID number.", 
    "EPA_LATEST_FCE_DATE_ACHIEVED": "The date of the latest evaluation of the plant by EPA.", 
    "STATE_CLASS_CODE_DESC": "The description of the AFS-generated code reflecting the delegated agency's (State/Local/Tribal) categorization of plants according to the Alabama Power Decision's definition of a major source, or if the emissions of a pollutant have exceeded the major threshold for that pollutant.  Values can be entered by the delegated agency or EPA.  AFS will generated a default value based on the highest level of emissions reported by either the delegated agency or EPA.", 
    "ES_COMPLIANCE_STATUS_DESC": "The description of a code which reflects the compliance of a plant which regards to pollutants regulated by an air program or by the procedural requirements of a permit.  Compliance falls within four categories:  In, Out, On Schedule, and Unknown.  Values entered at the Plant Air Program Pollutant level are compared by AFS and the most serious generated and displayed at the Plant Air Program and Plant General level.", 
    "EPA_COMPLIANCE_STATUS": "A code which reflects the EPA's determination of the compliance of a plant which regards to pollutants regulated by an air program or by the procedural requirements of a permit.  This value is normally populated only when the EPA assessment differs from the state or the air program has not been delegated to the appropriate agency for oversight.  Compliance falls within four categories:  In, Out, On Schedule, and Unknown.  Values entered at the Plant Air Program Pollutant level are compared by AFS and the most serious generated and displayed at the Plant Air Program and Plant General level.", 
    "ES_COMPLIANCE_STATUS": "An AFS-generated code which reflects the compliance of a plant which regards to pollutants regulated by an air program or by the procedural requirements of a permit.   Compliance falls within four categories:  In, Out, On Schedule, and Unknown.  Values entered at the Plant Air Program Pollutant level are compared by AFS and the most serious generated and displayed at the Plant Air Program and Plant General level.", 
    "ES_CLASS_CODE": "A default code generated by AFS (from EPA and State values) categorizing plants according to the Alabama Power Decision's definition of a major source, or if the emissions of a pollutant have exceeded the major threshold for that pollutant.  Values can be entered by the delegated agency or EPA.  AFS will generated a default value based on the highest level of emissions reported by either the delegated agency or EPA.", 
    "EPA_CLASS_CODE_DESC": "The description of the AFS-generated reflecting EPA's categorization of plants according to the Alabama Power Decision's definition of a major source, or if the emissions of a pollutant have exceeded the major threshold for that pollutant.  Values can be entered by the delegated agency or EPA.  AFS will generated a default value based on the highest level of emissions reported by either the delegated agency or EPA.", 
    "MAILING_STATE_NAME": "Mailing State Name", 
    "EPA_LATEST_FCE_ACTION_TYPE": "The action type code reflecting the latest evaluation of the plant by EPA.", 
    "PHONE_AREA_CODE_COMPLIANCE": "Phone Area Code Compliance", 
    "STATE_COMPLIANCE_STATUS": "A code which reflects the delegated agency's (State/Local/Tribal) determination of the compliance of a plant which regards to pollutants regulated by an air program or by the procedural requirements of a permit.   Compliance falls within four categories:  In, Out, On Schedule, and Unknown.  Values entered at the Plant Air Program Pollutant level are compared by AFS and the most serious generated and displayed at the Plant Air Program and Plant General level.", 
    "MAILING_ZIP": "Mailing Zip", 
    "MAILING_STREET_ADDRESS": "Mailing Street Address", 
    "EPA_COMPLIANCE_STATUS_DESC": "The description of a code which reflects the EPA's determination of the compliance of a plant which regards to pollutants regulated by an air program or by the procedural requirements of a permit.  This value is normally populated only when the EPA assessment differs from the state or the air program has not been delegated to the appropriate agency for oversight.  Compliance falls within four categories:  In, Out, On Schedule, and Unknown.  Values entered at the Plant Air Program Pollutant level are compared by AFS and the most serious generated and displayed at the Plant Air Program and Plant General level.", 
    "MAILING_STATE_ABBREV": "Mailing State Abbrev", 
    "PHONE_COMPLIANCE": "Phone Compliance", 
    "MAILING_CITY": "Mailing City", 
    "STATE_LATEST_FCE_DATE_ACHIEVED": "The date of the latest evaluation of the plant by the delegated agency (State/Local/Tribal).", 
    "EPA_CLASS_CODE": "An AFS-generated code reflecting EPA's categorization of plants according to the Alabama Power Decision's definition of a major source, or if the emissions of a pollutant have exceeded the major threshold for that pollutant.  Values can be entered by the delegated agency or EPA.  AFS will generated a default value based on the highest level of emissions reported by either the delegated agency or EPA."
  }
}
